---
kind: method
id: M:Autodesk.Revit.DB.TessellatedShapeBuilderResult.GetNumberOfFaceSets
source: html/c5e36953-ef39-f868-f49b-313db8055bcc.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilderResult.GetNumberOfFaceSets Method

Gets number of face sets for which 'this' result was obtained.

## Syntax (C#)
```csharp
public int GetNumberOfFaceSets()
```

## Returns
The number of face sets.